Revit 2026 API

# BuiltInFailuresGridChainSketchFailures Class

---

Failures related to the GridChain sketch.

SystemObject Autodesk.Revit.DBBuiltInFailuresGridChainSketchFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class GridChainSketchFailures
```
```vb
Public NotInheritable Class GridChainSketchFailures
```
```cpp
public ref class GridChainSketchFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type GridChainSketchFailures = class end
```

The BuiltInFailuresGridChainSketchFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ClosedLoop | GridChain sketch contains a closed loop. |
|  | InvalidSketch | Sketch is invalid. Grid sketch must consist of a single open loop with no intersecting lines. |
|  | MoreThanOneLoop | GridChain sketch contains more than one loop. |
|  | OverlappingLines | GridChain sketch contains lines which overlap. |

#### Reference

Autodesk.Revit.DB Namespace